#include <stdio.h>

//---------------------------------判断奇偶数
// int main() {
//     int num = 0;
//     scanf("%d", &num);

//     if (num % 2 == 0)
//     {
//         printf("是偶数\n");
//     } else {
//         printf("是奇数\n");
//     }
//     return 0;
// }
//---------------------------------
//---------------------------------打印1-100奇数
// int main() {
//     //int i = 0;
//     for (int i = 0; i <= 100; i++)
//     {
//         if (i % 2 == 1)
//         {
//             printf("%d ", i);
//         }   
//     }
//     return 0;
// }
//---------------------------------
// int main() {
//     int ch = '\0';
//     while ((ch = getchar()) != EOF)
//     {
//         if (ch < '0' || ch > '9')
//             continue;
//         putchar(ch);
//     }
//     return 0;
// }
//---------------------------------